```json

{

  "Chamada_Publica": "01/2020 - Tecnova II",
  "Programa": "Programa de Subvenção Econômica para Apoio à Inovação e o Desenvolvimento Tecnológico em Empresas Nacionais Sediadas no Estado do Paraná",
  "Anexo": "I – PLANO DE TRABALHO",
  "Preenchimento_Sistema": "(A SER PREENCHIDO VIA SISTEMA SPARKX)",
  "1_Dados_Cadastrais": {
    "1.1_Empresa_Proponente": {
      "Razao_social": "AZAGROS - AGROTECNOLOGIA LTDA [cite: 1]",
      "CNPJ": "30.770.761/0001-93 [cite: 1]",
      "Sigla": "AZAGROS [cite: 1]",
      "Endereco_comercial": "Rua 28 de Novembro, 189, Sala 31 [cite: 1]",
      "Bairro": "Centro [cite: 1]",
      "Cidade": "Dois Vizinhos [cite: 1]",
      "UF": "PR [cite: 1]",
      "CEP": "85.660-000 [cite: 1]",
      "Telefone": null,
      "Email": "adm@azagros.com.br [cite: 1]",
      "Caixa_Postal": null,
      "Natureza_Juridica": "Sociedade Empresária Limitada [cite: 1]",
      "Atividade_economica_predominante": "62.01-5-01 - Desenvolvimento de programas de computador sob encomenda [cite: 1]",
      "Objetivo_Social": "Desenvolvimento de soluções tecnológicas para o agronegócio, com foco em agricultura sustentável e digitalização de processos para pequenos e médios produtores. [cite: 1]",
      "Receita_anual": "R$",
      "Historico_da_empresa": "A Azagros é uma empresa paranaense de base tecnológica com foco no desenvolvimento de soluções para o agronegócio sustentável. Atua no desenvolvimento de tecnologias acessíveis como sensores, plataformas de inteligência artificial e aplicativos móveis voltados à agricultura familiar. A empresa surgiu da união entre profissionais das áreas de tecnologia, meio ambiente e gestão de inovação, com o propósito de democratizar o acesso à tecnologia no campo e gerar impacto social positivo. [cite: 1]",
      "Instalacoes_fisicas": "Escritório sede equipado para desenvolvimento de software e análise de dados, estação de testes para sensores ambientais e parcerias com propriedades rurais locais para validação em campo. [cite: 1]",
      "Historico_PD&I": null,
      "Politica_Propriedade_Intelectual": {
        "Nao": false,
        "Sim": true,
        "Descricao": null
      },
      "Patentes_Transferencia_Tecnologia_Outros_Registros": null
    },
    "1.2_Dirigente_Responsavel_Legal": {
      "Nome": "Rosangela Stum Nonemacher [cite: 1]",
      "Cargo": "Sócia Administradora [cite: 1]",
      "CPF": "940.987.519-68 [cite: 1]",
      "RG": "6.188.473-4 [cite: 1]",
      "Orgao_expedidor": "SSP-PR [cite: 1]",
      "Endereco_residencial": "Rua Gonçalves Dias, 422 [cite: 1]",
      "Bairro": "Batel [cite: 1]",
      "Cidade": "Curitiba [cite: 1]",
      "UF": "PR [cite: 1]",
      "CEP": "80.240-340 [cite: 1]",
      "Telefone_fixo": null,
      "Telefone_celular": "4699915-3365 [cite: 1]",
      "Email": "rosangela@azagros.com [cite: 1]"
    }
  },
  "2_Dados_do_Projeto": {
    "2.1_Descricao": {
      "Titulo_do_projeto": "Azagros AI [cite: 2]",
      "Protocolo": "(Não preencher – Automático Sistema) [cite: 2]",
      "Duracao_prevista": {
        "Inicio": "Mês/Ano",
        "Termino": "Mês/Ano"
      },
      "Tema_prioritario": "Agricultura & Agronegócio [cite: 2]",
      "Resumo_publicavel": "O projeto Azagros AI propõe o desenvolvimento de uma plataforma tecnológica integrada, voltada à agricultura familiar e sustentável, com foco em pequenos produtores rurais do Paraná. A solução combina sensores ambientais de baixo custo, algoritmos de inteligência artificial explicável e um aplicativo móvel intuitivo para gerar diagnósticos e recomendações sobre o manejo da produção. Com isso, busca-se otimizar o uso de recursos naturais, aumentar a produtividade e fortalecer práticas agroecológicas de forma acessível, inteligente e escalável. [cite: 2]",
      "Justificativa_e_relevancia": "Pequenos produtores rurais representam a base da agricultura no Paraná, porém ainda enfrentam limitações no acesso a tecnologias que melhorem sua produtividade e reduzam os impactos ambientais. A proposta da Azagros AI responde diretamente a essa lacuna, unindo inovação digital e sustentabilidade no campo. Alinhada às diretrizes do edital TECNOVA III e às áreas prioritárias definidas pelo CCT-Paraná, a iniciativa contribui para a transformação digital no agronegócio, promove inclusão tecnológica, fomenta práticas regenerativas e se insere como solução estratégica frente aos desafios das mudanças climáticas e da transição ecológica. [cite: 2]",
      "Objetivo_Geral": "Desenvolver e validar uma solução tecnológica baseada em sensoriamento ambiental e inteligência artificial para a agricultura sustentável de pequenos produtores rurais do Paraná, promovendo eficiência produtiva com responsabilidade ecológica. [cite: 2]",
      "Objetivos_Especificos": [
        {
          "Objetivo_Especifico": "Desenvolver protótipos funcionais de sensores ambientais (solo, umidade, temperatura, pH). [cite: 2]",
          "Indicador": "Quantidade de sensores construídos e testados [cite: 2]",
          "Meta_Fisica": "10 sensores operacionais até o 12º mês [cite: 2]"
        },
        {
          "Objetivo_Especifico": "Construir e treinar modelos de IA explicável para apoio à decisão no manejo agrícola. [cite: 2]",
          "Indicador": "Número de modelos treinados [cite: 2]",
          "Meta_Fisica": "3 modelos de IA treinados e validados até o 18º mês [cite: 2]"
        },
        {
          "Objetivo_Especifico": "Desenvolver aplicativo móvel para interface com os produtores e visualização de dados. [cite: 2]",
          "Indicador": "Aplicativo funcional entregue [cite: 2]",
          "Meta_Fisica": "MVP funcional validado até o 24º mês [cite: 2]"
        },
        {
          "Objetivo_Especifico": "Realizar testes de campo com produtores rurais do Paraná. [cite: 2]",
          "Indicador": "Número de propriedades participantes nos testes [cite: 2]",
          "Meta_Fisica": "10 propriedades atendidas até o 30º mês [cite: 2]"
        },
        {
          "Objetivo_Especifico": "Avaliar impacto da solução em produtividade e sustentabilidade [cite: 2]",
          "Indicador": "Relatório técnico de impacto elaborado [cite: 2]",
          "Meta_Fisica": "1 relatório conclusivo entregue até o 36º mês [cite: 2]"
        }
      ]
    },
    "2.2_Coordenador_Tecnico_do_Projeto": {
      "Nome": "Rosangela Stum Nonemacher [cite: 1]",
      "Cargo": "Coordenadora Técnica / Sócia Administradora [cite: 1]",
      "CPF": "940.987.519-68 [cite: 1]",
      "RG": "6.188.473-4 [cite: 1]",
      "Orgao_expedidor": "SSP-PR [cite: 1]",
      "Endereco_residencial": "Rua Gonçalves Dias, 422 [cite: 1]",
      "Bairro": "Batel [cite: 1]",
      "Cidade": "Curitiba [cite: 1]",
      "UF": "PR [cite: 1]",
      "CEP": "80.240-340 [cite: 1]",
      "Telefone_fixo": null,
      "Telefone_celular": "(46)99915-3365 [cite: 1]",
      "Email": "rosangela@azagros.com [cite: 1]",
      "Vinculo_com_a_empresa_proponente": "Sócia administradora [cite: 1]"
    },
    "2.3_Equipe_Tecnica_do_Projeto": [
      {
        "Nome": null,
        "CPF": null,
        "Tipo_de_vinculo_com_a_empresa": null,
        "Atividade_que_desenvolvera_no_projeto": null,
        "Tempo_de_dedicacao_horas_semana": null,
        "Custo_Total_Estimado_R$": null
      },
      {
        "Nome": null,
        "CPF": null,
        "Tipo_de_vinculo_com_a_empresa": null,
        "Atividade_que_desenvolvera_no_projeto": null,
        "Tempo_de_dedicacao_horas_semana": null,
        "Custo_Total_Estimado_R$": null
      },
      {
        "Nome": null,
        "CPF": null,
        "Tipo_de_vinculo_com_a_empresa": null,
        "Atividade_que_desenvolvera_no_projeto": null,
        "Tempo_de_dedicacao_horas_semana": null,
        "Custo_Total_Estimado_R$": null
      }
    ],
    "Observacoes_Equipe_Tecnica": {
      "Vinculo_ICTPR": "No caso de vínculo com ICTPR, preencher Declaração Institucional da empresa sobre o vínculo de integrantes da equipe técnica executora, anexar Curriculum Lattes e atestado de vínculo institucional, conforme item 14.3, “e” – anexo III. [cite: 3]",
      "Custo_Estimado_Observacao": "Estimativa do total de vencimentos + obrigações patronais pelo número de horas de dedicação ao projeto. [cite: 3]"
    },
    "2.4_Metodologia": {
      "Descricao": "O projeto será estruturado em cinco etapas principais, seguindo práticas usuais de desenvolvimento tecnológico na área de agricultura de precisão, sensoriamento e inteligência artificial. Inicialmente, serão realizados levantamentos técnicos e validações de requisitos com produtores rurais para garantir aderência às necessidades do público-alvo. Em seguida, a equipe técnica desenvolverá os sensores ambientais de baixo custo e os modelos de inteligência artificial explicável, treinados com dados reais. Paralelamente, será construída uma aplicação móvel com interface amigável para facilitar o acesso dos produtores às análises e recomendações. Os protótipos serão testados em campo em propriedades parceiras no Paraná, permitindo ajustes iterativos com base em dados reais e feedback dos usuários. Ao longo do projeto, serão produzidos relatórios técnicos, análises de impacto e documentação dos processos, visando tanto a validação quanto a futura escalabilidade da solução. [cite: 4]"
    },
    "2.5_Grau_de_Inovacao": {
      "Descricao": "O projeto Azagros AI promove inovação tanto em produto quanto em processo. A proposta combina sensores ambientais de baixo custo com inteligência artificial explicável e uma interface móvel simplificada voltada à agricultura familiar, um segmento historicamente pouco atendido por soluções tecnológicas de ponta. O diferencial está na acessibilidade da solução, na integração de dados em tempo real com recomendações automatizadas e no foco em práticas sustentáveis, o que tende a gerar alta percepção de valor pelos clientes finais. Trata-se de uma abordagem inédita no Brasil voltada especificamente para pequenos produtores com suporte a práticas regenerativas e de baixo impacto ambiental. [cite: 5]",
      "Complexidade_tecnologica": "Média a alta. O projeto envolve integração de hardware (sensores ambientais), software (modelos de IA e aplicativo), conectividade no campo e análise de dados com IA explicável. A complexidade está na precisão dos dados, capacidade de generalização dos modelos e usabilidade em ambientes de baixa conectividade. [cite: 5]",
      "Estagio_de_desenvolvimento": "TRL 4 a 6. Atualmente, existem protótipos em desenvolvimento (sensores e modelos básicos de IA) e uma arquitetura preliminar da plataforma. A proposta prevê avanço até o estágio de validação em ambiente real com usuários finais (TRL 6). Existe possibilidade concreta de registro de software e, potencialmente, de patenteamento de sensores modulares desenvolvidos sob demanda. [cite: 5]",
      "Nivel_de_abrangencia": {
        "Empresa": false,
        "Local_Regional": false,
        "Nacional": true,
        "Mundial": true
      }
    },
    "2.6_Viabilidade_Mercadologica": {
      "Vantagens_competitivas": "A principal vantagem da solução Azagros AI está na combinação de tecnologias de ponta com simplicidade de uso e acessibilidade econômica. Enquanto boa parte das soluções de agricultura digital disponíveis hoje são voltadas a grandes propriedades e exigem alto investimento, a Azagros foca no pequeno produtor, oferecendo sensores de baixo custo, IA explicável e um aplicativo intuitivo, mesmo em regiões de baixa conectividade. A personalização dos diagnósticos agrícolas e o suporte a práticas sustentáveis são diferenciais que reforçam sua proposta de valor. [cite: 6]",
      "Mercado_potencial": "O mercado potencial é nacional e internacional, com foco inicial na agricultura familiar do estado do Paraná, que conta com mais de 280 mil estabelecimentos rurais, sendo a maioria operada por pequenos produtores. No Brasil, esse número ultrapassa 3,9 milhões de propriedades familiares. Internacionalmente, países da América Latina e África compartilham desafios semelhantes e demandam soluções acessíveis em tecnologia agrícola. [cite: 6]",
      "Clientes_potenciais": [
        "Pequenos produtores rurais [cite: 6]",
        "Associações e cooperativas agrícolas [cite: 6]",
        "Organizações de assistência técnica rural (públicas e privadas) [cite: 6]",
        "ONGs e órgãos de fomento ao desenvolvimento rural sustentável [cite: 6]",
        "Prefeituras e secretarias municipais de agricultura [cite: 6]"
      ],
      "Concorrentes": null,
      "Estrategias_promocao_venda": [
        "Parcerias com sindicatos rurais, cooperativas e prefeituras [cite: 6]",
        "Participação em feiras e eventos agropecuários [cite: 6]",
        "Programas piloto com produtores para gerar cases de sucesso [cite: 6]",
        "Ações de marketing digital segmentado e conteúdo educativo [cite: 6]",
        "Utilização de agentes locais e extensionistas como promotores da solução [cite: 6]"
      ],
      "Processo_venda_entrega": "A comercialização da solução será feita por canais diretos, como site oficial, rede de contatos comerciais e parceiros locais no setor agrícola. O modelo de negócio incluirá licenciamento por assinatura mensal ou anual, com acesso à plataforma digital (aplicativo móvel e painel web) e suporte técnico remoto. A entrega será inteiramente digital, com implantação guiada, treinamento remoto e conteúdos de apoio disponíveis na própria aplicação, garantindo escalabilidade e facilidade de adoção pelos usuários em diferentes regiões. [cite: 6]"
    },
    "2.7_Aspectos_eticos_e_de_biosseguranca": "O projeto Azagros AI não envolve experimentação com seres humanos nem manipulação genética de organismos vivos ou substâncias potencialmente nocivas ao meio ambiente e à saúde pública. Todas as atividades serão realizadas em conformidade com as boas práticas de desenvolvimento tecnológico e pesquisa aplicada, observando os princípios éticos e legais vigentes no Brasil. Caso sejam necessárias parcerias com propriedades rurais para testes de campo, estas serão formalizadas por meio de termos de consentimento dos participantes, garantindo total transparência, voluntariedade e respeito à privacidade dos dados. O projeto não se enquadra nas exigências de submissão à Comissão Nacional de Ética em Pesquisa (CONEP), conforme a Resolução CNS nº 510/2016. [cite: 7]",
    "2.8_Resultados_e_beneficios_esperados": {
      "Aspecto_social": "O projeto contribuirá para a inclusão digital de pequenos produtores rurais, promovendo a democratização do acesso à tecnologia no campo. Por meio de uma solução acessível e fácil de usar, espera-se melhorar a qualidade de vida dos agricultores, aumentar sua autonomia na tomada de decisões e fortalecer a agricultura familiar, gerando impactos positivos nas comunidades rurais e na segurança alimentar. [cite: 7]",
      "Aspecto_economico": "A adoção da tecnologia proposta poderá aumentar a produtividade das lavouras, reduzir perdas por manejo inadequado e otimizar o uso de insumos. Com isso, estima-se uma elevação da rentabilidade para os produtores atendidos, além da abertura de novas oportunidades de negócio para a Azagros e seus parceiros, com potencial de escalabilidade em nível nacional e internacional. [cite: 7]",
      "Aspecto_ambiental": "A plataforma proporcionará uma gestão mais eficiente dos recursos naturais, como água, solo e insumos agrícolas, incentivando práticas de agricultura regenerativa e de baixo impacto ambiental. A solução ajudará na redução do uso excessivo de fertilizantes e defensivos, contribuindo para a conservação ambiental e mitigação dos efeitos das mudanças climáticas. [cite: 7]",
      "Aspecto_tecnico": "O projeto fomentará o desenvolvimento e integração de tecnologias emergentes — como sensoriamento remoto, inteligência artificial explicável e aplicações móveis — aplicadas ao setor agrícola. A validação em campo permitirá gerar conhecimento técnico aplicável e replicável, além de fortalecer a capacidade da empresa em inovação e no desenvolvimento de soluções de base tecnológica com alto impacto. [cite: 7]"
    },
    "2.9_Infraestrutura_disponivel": [
      {
        "Descricao_resumida": null,
        "Valor_estimado_R$": null
      },
      {
        "Descricao_resumida": null,
        "Valor_estimado_R$": null
      },
      {
        "Descricao_resumida": null,
        "Valor_estimado_R$": null
      },
      {
        "Descricao_resumida": null,
        "Valor_estimado_R$": null
      },
      {
        "Descricao_resumida": null,
        "Valor_estimado_R$": null
      },
      {
        "Descricao_resumida": null,
        "Valor_estimado_R$": null
      },
      {
        "Descricao_resumida": null,
        "Valor_estimado_R$": null
      },
      {
        "Descricao_resumida": null,
        "Valor_estimado_R$": null
      },
      {
        "Descricao_resumida": null,
        "Valor_estimado_R$": null
      }
    ],
    "2.10_Cronograma_Fisico_Plano_de_Etapas": {
      "Instrucoes": "Enumerar e descrever as metas e as atividades que compõem o Projeto, informando como realizará, os indicadores (quantidade e unidade de medida) e o período de execução. Não existe limitação para a quantidade de metas e atividades. [cite: 8]",
      "Metas_e_Atividades": [
        {
          "Meta": "1. Pesquisa e Desenvolvimento Tecnológico Inicial [cite: 8]",
          "Atividades": [
            {
              "Numero": "1.1.",
              "Como_realizara": "Reuniões técnicas, entrevistas e diagnósticos [cite: 8]",
              "Indicadores": {
                "Quantidade": "10 [cite: 8]",
                "Unidade": "propriedades [cite: 8]"
              },
              "Execucao": {
                "Inicio": "01/2026 [cite: 8]",
                "Termino": "03/2026 [cite: 8]"
              },
              "Valor_previsto_R$": "R$ 30.000,00 [cite: 8]"
            },
            {
              "Numero": "1.2.",
              "Como_realizara": "Projeto eletrônico, montagem e testes [cite: 8]",
              "Indicadores": {
                "Quantidade": "10 [cite: 8]",
                "Unidade": "sensores [cite: 8]"
              },
              "Execucao": {
                "Inicio": "02/2026 [cite: 8]",
                "Termino": "08/2026 [cite: 8]"
              },
              "Valor_previsto_R$": "R$ 100.000,00 [cite: 8]"
            },
            {
              "Numero": "1.3.",
              "Como_realizara": "Coleta de dados, modelagem e validação [cite: 8]",
              "Indicadores": {
                "Quantidade": "3 [cite: 8]",
                "Unidade": "modelos [cite: 8]"
              },
              "Execucao": {
                "Inicio": "04/2026 [cite: 8]",
                "Termino": "12/2026 [cite: 8]"
              },
              "Valor_previsto_R$": "R$ 70.000,00 [cite: 8]"
            },
            {
              "Numero": "1.4.",
              "Como_realizara": "Testes em condições reais com coleta de desempenho [cite: 8]",
              "Indicadores": {
                "Quantidade": "2 [cite: 8]",
                "Unidade": "relatórios [cite: 8]"
              },
              "Execucao": {
                "Inicio": "06/2026 [cite: 8]",
                "Termino": "10/2026 [cite: 8]"
              },
              "Valor_previsto_R$": "R$ 40.000,00 [cite: 8]"
            }
          ]
        },
        {
          "Meta": "2. Construção da Plataforma e Validação Técnica [cite: 8]",
          "Atividades": [
            {
              "Numero": "2.1.",
              "Como_realizara": "Design UX/UI e programação com metodologias ágeis [cite: 8]",
              "Indicadores": {
                "Quantidade": "1 [ci